EDT/УТ/src/Documents/ВводДанныхОМотивацииЭкипажа/ВводДанныхОМотивацииЭкипажа.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВводДанныхОМотивацииЭкипажа</name>
  <registerRecords>InformationRegister.НУЭкипажей</registerRecords>
  <attributes>
    <name>МесяцРасчета</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>СтатьиНУ</name>
    <attributes>
      <name>ФизЛицо</name>
      <type>
        <types>CatalogRef.новаЭкспедиторы</types>
        <types>CatalogRef.новаВодители</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяНУ</name>
      <type>
        <types>CatalogRef.НачисленияУдержанияЭкипажей</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Процент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипРасчета</name>
      <type>
        <types>EnumRef.ВариантыРасчетаНУЭкипажей</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>МесяцРасчета</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

EDT/УТ/src/InformationRegisters/НУЭкипажей/НУЭкипажей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НУЭкипажей</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Процент</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ФизЛицо</name>
    <type>
      <types>CatalogRef.новаЭкспедиторы</types>
      <types>CatalogRef.новаВодители</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатьяНУ</name>
    <type>
      <types>CatalogRef.НачисленияУдержанияЭкипажей</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/УТ/src/Documents/ВводДанныхОМотивацииЭкипажа/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр НУЭкипажей
	Движения.НУЭкипажей.Записывать = Истина;
	Движения.НУЭкипажей.Очистить();
	Для Каждого ТекСтрокаСтатьиНУ Из СтатьиНУ Цикл
		Движение = Движения.НУЭкипажей.Добавить();
		Движение.Период = ТекСтрокаСтатьиНУ.МесяцРасчета;
		Движение.ФизЛицо = ТекСтрокаСтатьиНУ.ФизЛицо;
		Движение.СтатьяНУ = ТекСтрокаСтатьиНУ.СтатьяНУ;
		Движение.Сумма = ТекСтрокаСтатьиНУ.Сумма;
		Движение.Процент = ТекСтрокаСтатьиНУ.Процент;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
